# Assignment #4 - Data Gathering and Warehousing - DSSA-5102

Instructor: Melissa Laurino</br>
Spring 2025</br>

Name: Justin Davis 
</br>
Date: 02/18/25
<br>
<br>
<b>Only Murders in the...Database?</b><br>
An introduction to navigating databases using SQL, Python and Jupyter Notebook. <br>
<br>
A crime has taken place and you are the perfect amateur detective to solve it! 
<br>
The detective gave you the crime scene report, but you somehow lost it...? You vaguely remember that the crime
was a murder that occurred sometime on <b>Jan.15, 2018</b> and that it took place in <b>SQL
City</b>. All the clues to this mystery are buried in a huge database, and you need to use
SQL to navigate through this network of information. Your first step to solving the mystery is to retrieve the corresponding crime scene report from the police department’s database. Take a look at the cheatsheet to learn how to do this! From there, you can use your SQL skills to find the murderer.<br>

Your task for <b>Assignment #4</b> is to:<br>
- Connect to the database stored locally using Python.
- Explore the database by listing all tables, fields within the tables, and data types.
- Find out who the murderer is!<br>
- Add detailed comments to explain EVERY query or SQL command you use while we are still learning and practicing. I have my steps outlined, but please add more cells inbetween for additional queries! There is no limit on the number of queries you can use. <br>
- For each query include comments such as "SELECT all records FROM table WHERE column name = X"<br>
- Answer any prompts in markdown cells.<br>
<br>

This fabulous database was created by @NUKnightLab on Github and can be found here: https://github.com/NUKnightLab/sql-mysteries

Database files are indicated by the .db file extension. For this exercise, our database has already been created. To avoid setting your working directory, have the .db file and Assignment#4_LastName.ipynb in the same file location. There are multiple libraries that can be used to navigate database files and connect to SQL for databases that are stored on a server or your computer as a local host.

In [4]:
#installing packages
!pip install sqlalchemy
!pip install sqlite3
# Load necessary packages:
from sqlalchemy import create_engine, inspect, text # Database navigation
import sqlite3 # A second option for working with databases
import pandas as pd # Python data manilpulation

Requirement already satisfied: sqlalchemy in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (2.0.38)
Requirement already satisfied: greenlet!=0.4.17 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from sqlalchemy) (4.12.2)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: pip install --upgrade pip
ERROR: Could not find a version that satisfies the requirement sqlite3 (from versions: none)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: pip install --upgrade pip
ERROR: No matching distribution found for sqlite3

Database files are indicated by the .db file extension. For this exercise, our database has already been created. To avoid setting your working directory, have the .db file and Assignment#4_LastName.ipynb in the same file location. There are multiple libraries depending on your platform that can be used to navigate database files and connect to SQL for databases that are stored on a server or your computer as a local host.

In [5]:
# How to connect to our .db file using library SQLAlchemy
# Notice that we are not specifiying a host, password, or server since this .db file is stored locally.
db_path = "sql-murder-mystery.db"  # Change this to your actual file name
engine = create_engine(f"sqlite:///{db_path}") # Use the create_engine function to connect to the database
engine # The f is the connection string, so if we print it we can see below

Engine(sqlite:///sql-murder-mystery.db)

SQLAlchemy needs to know what kind of database we are accessing. .db files can be treated as a SQLite database. Other options include databases formatted for MySQL, PostgreSQL, etc. Database type prefixes must be included.

In [124]:
# Explore the database
explore = inspect(engine)
# List the tables in our database:
tables = explore.get_table_names()
print(tables)

#murder
#jan 15, 2018
#SQL City

# So much data! How would we possibly make sense of ANY of this without SQL? :)

['crime_scene_report', 'drivers_license', 'facebook_event_checkin', 'get_fit_now_check_in', 'get_fit_now_member', 'income', 'interview', 'person', 'solution']

In [103]:
# What are the column names for each table? What table will help us get to the next clue?
print("\n The crime_scene_report will probably help figure out more clues to the crime.")
for table in tables:
    print(f"Columns in table '{table}':")
    columns = explore.get_columns(table)
    for column in columns:
        print(f"- {column['name']} (Type: {column['type']})")
    print()

 The crime_scene_report will probably help figure out more clues to the crime.
Columns in table 'crime_scene_report':
- date (Type: INTEGER)
- type (Type: TEXT)
- description (Type: TEXT)
- city (Type: TEXT)

Columns in table 'drivers_license':
- id (Type: INTEGER)
- age (Type: INTEGER)
- height (Type: INTEGER)
- eye_color (Type: TEXT)
- hair_color (Type: TEXT)
- gender (Type: TEXT)
- plate_number (Type: TEXT)
- car_make (Type: TEXT)
- car_model (Type: TEXT)

Columns in table 'facebook_event_checkin':
- person_id (Type: INTEGER)
- event_id (Type: INTEGER)
- event_name (Type: TEXT)
- date (Type: INTEGER)

Columns in table 'get_fit_now_check_in':
- membership_id (Type: TEXT)
- check_in_date (Type: INTEGER)
- check_in_time (Type: INTEGER)
- check_out_time (Type: INTEGER)

Columns in table 'get_fit_now_member':
- id (Type: TEXT)
- person_id (Type: INTEGER)
- name (Type: TEXT)
- membership_start_date (Type: INTEGER)
- membership_status (Type: TEXT)

Columns in table 'income':
- ssn (Type: INTEGER)
- annual_income (Type: INTEGER)

Columns in table 'interview':
- person_id (Type: INTEGER)
- transcript (Type: TEXT)

Columns in table 'person':
- id (Type: INTEGER)
- name (Type: TEXT)
- license_id (Type: INTEGER)
- address_number (Type: INTEGER)
- address_street_name (Type: TEXT)
- ssn (Type: INTEGER)

Columns in table 'solution':
- user (Type: INTEGER)
- value (Type: TEXT)

Practice using commmands useful in queries:

In [18]:
# Example: 
# Select all records from the table crime_scene_report where type is murder:

with engine.connect() as connection:  # Establish a connection
    query = text("""SELECT * 
                    FROM crime_scene_report 
                    WHERE type='murder'
                    """)                      # Define the query - text() ensures that the query string is read as a SQL expression 
    practice = pd.read_sql(query, connection) #Use pandas to read the sql query with the connection to the database
    
# Print the results
practice

,date,type,description,city
0,20180115,murder,Life? Dont talk to me about life.,Albany
1,20180115,murder,"Mama, I killed a man, put a gun against his he...",Reno
2,20180215,murder,REDACTED REDACTED REDACTED,SQL City
3,20180215,murder,Someone killed the guard! He took an arrow to ...,SQL City
4,20170107,murder,‘It proves nothing of the sort!’ said Alice. ‘...,Memphis
...,...,...,...,...
143,20180427,murder,"‘Only a thimble,’ said Alice sadly.\n",St. Petersburg
144,20180428,murder,wag my tail when I’m angry. Therefore I’m mad.’\n,Appleton
145,20180429,murder,"(she was obliged to say ‘creatures,’ you see, ...",Toledo
146,20180430,murder,‘But what am I to do?’ said Alice.\n,Spokane
147,20180115,murder,Security footage shows that there were 2 witne...,SQL City

In [29]:
#Select all records from the table drivers_license where the eye color is blue:
#Query for all records from drivers_license where eye color is 'blue'
with engine.connect() as connection:  # Establish a connection
    query2 = text("""SELECT * 
                     FROM drivers_license 
                     WHERE eye_color='blue'
                     """)  # Define the query for eye color = blue
    practice2 = pd.read_sql(query2, connection)  # Use pandas to execute the query and fetch results





practice2

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,101255,18,79,blue,grey,female,5162Z1,Lexus,GS
1,101494,48,55,blue,red,female,81X1N7,Kia,Sportage
2,101611,40,65,blue,white,female,5O8VW7,GMC,Sierra Denali
3,101726,78,81,blue,blue,female,236T17,Oldsmobile,Intrigue
4,101836,56,51,blue,grey,female,3VSG76,Hyundai,Azera
...,...,...,...,...,...,...,...,...,...
2020,996697,68,73,blue,black,female,QVEW13,Ferrari,612 Scaglietti
2021,997724,65,73,blue,blonde,male,640570,Toyota,Highlander
2022,997950,84,69,blue,grey,female,66DP8D,Infiniti,G37
2023,998114,46,50,blue,brown,female,I0GI33,Mercedes-Benz,SLK-Class
2024,998681,65,67,blue,green,female,7N21H3,Chrysler,Aspen

In [28]:
#Select distinct records of eye_color from the table drivers_license:
with engine.connect() as connection:  # Establish a connection
    query3 = text("""SELECT DISTINCT eye_color 
                     FROM drivers_license 
                     """)  #defining a query for distinct eye color
    practice3 = pd.read_sql(query3, connection)  # Use pandas to execute the query and fetch results







practice3

  eye_color
0     brown
1     green
2     amber
3      blue
4     black

In [21]:
#Select distinct records of name from the table person:
with engine.connect() as connection:  # Establish a connection
    query4 = text("""SELECT DISTINCT name 
                     FROM person 
                     """)  #defining a query for distinct name
    practice4 = pd.read_sql(query4, connection)  # Use pandas to execute the query and fetch results







practice4

                      name
0       Christoper Peteuil
1      Kourtney Calderwood
2                Muoi Cary
3              Era Moselle
4             Trena Hornby
...                    ...
10006          Luba Benser
10007      Roxana Mckimley
10008      Cherie Zeimantz
10009          Allen Cruse
10010         Vance Hunten

[10011 rows x 1 columns]

In [23]:
#Select distinct records of gender AND car_model from the table drivers_license:
with engine.connect() as connection:  # Establish a connection
    query5 = text("""SELECT DISTINCT gender,car_model
                     FROM drivers_license 
                     """)  #defining a query for distinct gender AND car_model
    practice5 = pd.read_sql(query5, connection)  # Use pandas to execute the query and fetch results







practice5

      gender car_model
0       male       MDX
1     female       SRX
2     female        xB
3     female     Rogue
4     female        GS
...      ...       ...
1365  female       550
1366  female   Prius c
1367  female       BRZ
1368    male   Mark LT
1369  female     HED-5

[1370 rows x 2 columns]

In [24]:
#Select distinct records of type and city from the table crime_scene_report:
with engine.connect() as connection:  # Establish a connection
    query6 = text("""SELECT DISTINCT type, city
                     FROM crime_scene_report 
                     """)  #defining a query for distinct type and city
    practice6 = pd.read_sql(query6, connection)  # Use pandas to execute the query and fetch results






practice6

         type          city
0     robbery           NYC
1      murder        Albany
2      murder          Reno
3      murder      SQL City
4       theft       Chicago
...       ...           ...
1038  robbery       Trenton
1039  bribery  Garden Grove
1040    fraud         Houma
1041  assault       Fontana
1042  assault       Trenton

[1043 rows x 2 columns]

In [26]:
#Select all records from table drivers_license where the age is == 40:
with engine.connect() as connection:  # Establish a connection
    query7 = text("""SELECT *
                     FROM drivers_license 
                     WHERE age == 40
                     """)  #defining a query for age == 40
    practice7 = pd.read_sql(query7, connection)  # Use pandas to execute the query and fetch results






practice7

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,101611,40,65,blue,white,female,5O8VW7,GMC,Sierra Denali
1,103725,40,57,black,green,female,81WZ22,Land Rover,Freelander
2,116863,40,63,black,black,female,1ZSI8C,Audi,A8
3,118332,40,75,green,black,male,6SG3W0,Mitsubishi,Diamante
4,122134,40,61,black,white,female,8616Y4,Chevrolet,Astro
...,...,...,...,...,...,...,...,...,...
143,969815,40,63,green,black,female,G40MZY,Chevrolet,Suburban 2500
144,973824,40,50,brown,blue,female,LEJ771,Ford,F250
145,974364,40,52,green,black,female,822S0D,Ford,E250
146,990554,40,63,amber,white,male,XH2QC0,Chrysler,Town & Country
147,992954,40,53,black,blonde,female,1QX3S8,Lexus,IS

In [27]:
#Select all records from table drivers_license where the age is greater than 21:
with engine.connect() as connection:  # Establish a connection
    query8 = text("""SELECT *
                     FROM drivers_license 
                     WHERE age > 21
                     """)  #defining a query for age > 21
    practice8 = pd.read_sql(query8, connection)  # Use pandas to execute the query and fetch results





practice8

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,100280,72,57,brown,red,male,P24L4U,Acura,MDX
1,100460,63,72,brown,brown,female,XF02T6,Cadillac,SRX
2,101029,62,74,green,green,female,VKY5KR,Scion,xB
3,101198,43,54,amber,brown,female,Y5NZ08,Nissan,Rogue
4,101494,48,55,blue,red,female,81X1N7,Kia,Sportage
...,...,...,...,...,...,...,...,...,...
9434,999509,42,80,amber,blue,female,8E403S,Morgan,Aero 8
9435,999536,56,65,green,green,female,4FFUD5,Mercury,Sable
9436,999940,71,61,green,green,male,1B8QN8,Mitsubishi,Eclipse
9437,999981,67,69,brown,blue,female,1684K3,Land Rover,LR2
9438,999986,49,58,green,grey,male,F8F64H,Lexus,LS

In [39]:
#Select all records from table drivers_license where the age is less than OR equal to 21:
#Do you see a difference in the number of rows?
with engine.connect() as connection:  # Establish a connection
    query9 = text("""SELECT *
                     FROM drivers_license 
                     WHERE age <= 21
                     """)  #defining a query for age <= 21
    practice9 = pd.read_sql(query9, connection)  # Use pandas to execute the query and fetch results




print(f"There are {len(practice9)} rows.")
practice9

There are 568 rows.

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,101255,18,79,blue,grey,female,5162Z1,Lexus,GS
1,102536,21,76,blue,blonde,male,3DG322,Suzuki,Grand Vitara
2,105064,20,53,black,blue,male,25UO1B,Mercedes-Benz,SL-Class
3,108374,18,63,brown,red,male,X2KE6N,Ford,Escape
4,109617,19,76,green,blue,male,UO2B77,Infiniti,G
...,...,...,...,...,...,...,...,...,...
563,992923,20,77,black,brown,female,GT0EX0,MINI,Cooper
564,996996,20,56,black,green,female,5Y0W6U,Maserati,Quattroporte
565,998350,20,78,amber,grey,male,6HRAXP,Mitsubishi,Lancer
566,999923,19,77,amber,black,female,5L0ZI4,GMC,Sierra 3500
567,999993,18,63,black,black,female,6UZO2O,Cadillac,DeVille

In [119]:
#Select all records from table get_fit_now_check_in and order by check_in_date:
#Do you see a difference in the number of rows?
with engine.connect() as connection:  # Establish a connection
    query10 = text("""SELECT * 
                     FROM get_fit_now_check_in 
                     ORDER BY check_in_date
                     """)  # Define the query to select all records and order by check_in_date
    practice10 = pd.read_sql(query10, connection)  # Use pandas to execute the query and fetch results




print(f"There are {len(practice10)} rows.")
practice10

There are 2703 rows.

     membership_id  check_in_date  check_in_time  check_out_time
0            82GA2       20170101            431            1116
1            KE0FH       20170101            375             447
2            C84S4       20170101            580             864
3            XTE42       20170101           1188            1199
4            TQU5U       20170101            381            1069
...            ...            ...            ...             ...
2698         C581L       20180430             76             642
2699         0U51D       20180501             88             218
2700         7788A       20180501            532             705
2701         VHN8M       20180501            658             989
2702         MORMA       20180501           1029            1183

[2703 rows x 4 columns]

In [41]:
#Select all records from table get_fit_now_check_in and order by check_in_date and order by check_in_time:
#Do you see a difference in the order of the rows?
with engine.connect() as connection:  # Establish a connection
    query11 = text("""SELECT * 
                     FROM get_fit_now_check_in 
                     ORDER BY check_in_date, check_in_time
                     """)  # Define the query to select all records and order by check_in_date and check_in_time
    practice11 = pd.read_sql(query11, connection)  # Use pandas to execute the query and fetch results




print(f"There are {len(practice11)} rows.")
practice11

There are 2703 rows.

     membership_id  check_in_date  check_in_time  check_out_time
0            C581L       20170101             23            1071
1            3JP0X       20170101            154             609
2            J2033       20170101            242             955
3            KE0FH       20170101            375             447
4            TQU5U       20170101            381            1069
...            ...            ...            ...             ...
2698         133ED       20180430           1197            1200
2699         0U51D       20180501             88             218
2700         7788A       20180501            532             705
2701         VHN8M       20180501            658             989
2702         MORMA       20180501           1029            1183

[2703 rows x 4 columns]

Now that we have practiced, let's solve this murder!

All we know at the start of our investigation is the <b>murder</b> occurred on <b>Jan.15, 2018</b> and that it took place in <b>SQL City<b>.

In [120]:
#Write a query in SQL to view the crime scene report 
#for the murder occurred on Jan.15, 2018 and that it took place in SQL City.
#Select ALL records FROM the table WHERE...
#this allows me to see the entire description 
pd.set_option('display.max_colwidth', None)

with engine.connect() as connection:  # Establish a connection
    query_murder = text("""SELECT * 
                    FROM crime_scene_report 
                    WHERE type='murder'
                    AND date == 20180115
                    AND city='SQL City'
                    """) #defining the query, from the crime_scene_report, I looked for where type is specifically murder, the date is jan 15, 2018, and the city is SQL City.
    murder = pd.read_sql(query_murder, connection) #Use pandas to read the sql query with the connection to the database



murder

,date,type,description,city
0,20180115,murder,"Security footage shows that there were 2 witnesses. The first witness lives at the last house on ""Northwestern Dr"". The second witness, named Annabel, lives somewhere on ""Franklin Ave"".",SQL City

Another clue! It looks like we have two witnesses! Now who are they and how do we find them?

In [88]:
#Write two queries in SQL to find each witness in the person table. 
#For the first query as first_witness, select all the records from person where the address_street_name is Northwestern Drive and order by adress_number
#Fetch the first_witness
with engine.connect() as connection:  # Establish a connection
    query_w1 = text("""SELECT * 
                       FROM person
                       WHERE address_street_name = 'Northwestern Dr'
                       ORDER BY address_number DESC
                       LIMIT 1
                       """) #DESC orders address number in decending order (since it was the last house)
                            #LIMIT limits the amount of rows
    w1 = pd.read_sql(query_w1, connection)  # Use pandas to execute the query and fetch results


w1

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [89]:
print(f'We have identified our first witness as {w1["name"].iloc[0]}. Now lets find the second!')

We have identified our first witness as Morty Schapiro. Now lets find the second!

In [78]:
#For the third query as second_witness,
#Select all the records from person where the address_street_name is Frnaklin Ave and the name includes Annabel. 
#Fetch the second_witness
with engine.connect() as connection:  # Establish a connection
    query_w2 = text("""SELECT * 
                       FROM person
                       WHERE address_street_name = 'Franklin Ave'
                       AND name LIKE '%Annabel%' 
                       """)  #LIKE finds text with the characters we want in it
    w2 = pd.read_sql(query_w2, connection)  # Use pandas to execute the query and fetch results


w2

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

In [84]:
print(f'We have identified our second witness as {w2["name"].iloc[0]}.') 
print("\n What were their witness statements? What did they see?")

We have identified our second witness as Annabel Miller.

 What were their witness statements? What did they see?

In [121]:
#For our fourth query, witness_statements, lets find out what each witness saw...or claim they saw?
#Select the person's name and interview where the person_id is X, X (Get the ID from the above queries)
#Columns in table 'interview':
#- person_id (Type: INTEGER)
#- transcript (Type: TEXT)

with engine.connect() as connection:  # Establish a connection
    query_statement1 = text("""SELECT * 
                       FROM interview
                       WHERE person_id == 14887
                       """) #from the interview, I wanted to see the transcript of id number 14887
    statement1 = pd.read_sql(query_statement1, connection)  # Use pandas to execute the query and fetch results

statement1

,person_id,transcript
0,14887,"I heard a gunshot and then saw a man run out. He had a ""Get Fit Now Gym"" bag. The membership number on the bag started with ""48Z"". Only gold members have those bags. The man got into a car with a plate that included ""H42W""."

In [122]:
with engine.connect() as connection:  # Establish a connection
    query_statement2 = text("""SELECT * 
                       FROM interview
                       WHERE person_id == 16371
                       """) #from the interview, I wanted to see the transcript of id number 16371
    statement2 = pd.read_sql(query_statement2, connection)  # Use pandas to execute the query and fetch results

statement2

,person_id,transcript
0,16371,"I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th."

A few new clues! Explore the different clues with multiple queries. Seems like a reliable statement!

In [123]:
#Create a query to select for the following clues: (You can create multiple queries or combine them into one and go from there.)
#Remember to write our your query in the comments!
#Columns in table 'get_fit_now_check_in':
#- membership_id (Type: TEXT)
#- check_in_date (Type: INTEGER)
#- check_in_time (Type: INTEGER)
#- check_out_time (Type: INTEGER)

#Columns in table 'get_fit_now_member':
#- id (Type: TEXT)
#- person_id (Type: INTEGER)
#- name (Type: TEXT)
#- membership_start_date (Type: INTEGER)
#- membership_status (Type: TEXT)

with engine.connect() as connection:  # Establish a connection
    query_search = text("""SELECT * 
                       FROM get_fit_now_member
                       WHERE membership_status LIKE '%gold%'
                       AND id LIKE '%48Z%'
                       """) #the witnesses said that they were a gold member, and their id had 48Z in it
    search = pd.read_sql(query_search, connection)  # Use pandas to execute the query and fetch results

search

      id  person_id           name  membership_start_date membership_status
0  48Z7A      28819   Joe Germuska               20160305              gold
1  48Z55      67318  Jeremy Bowers               20160101              gold

In [100]:
with engine.connect() as connection:  # Establish a connection
    query_search2 = text("""SELECT * 
                       FROM get_fit_now_check_in
                       WHERE check_in_date == 20180109
                       AND membership_id LIKE '%48Z%'
                       """) #the witnesses said they saw the murderer at the gym last on jan 09, 2018
    search2 = pd.read_sql(query_search2, connection)  # Use pandas to execute the query and fetch results

search2

#These are the same as id's as the two above, so it checks out that these two are our
#prime suspects.

  membership_id  check_in_date  check_in_time  check_out_time
0         48Z7A       20180109           1600            1730
1         48Z55       20180109           1530            1700

In [102]:
#Was also given info about license plates so I will check that too.

#Columns in table 'drivers_license':
#- id (Type: INTEGER)
#- age (Type: INTEGER)
#- height (Type: INTEGER)
#- eye_color (Type: TEXT)
#- hair_color (Type: TEXT)
#- gender (Type: TEXT)
#- plate_number (Type: TEXT)
#- car_make (Type: TEXT)
#- car_model (Type: TEXT)

with engine.connect() as connection:  # Establish a connection
    query_search3 = text("""SELECT * 
                       FROM drivers_license
                       WHERE plate_number LIKE '%H42W%'
                       """) #we were also given information about the escape vehicle in the witness's statement 
    search3 = pd.read_sql(query_search3, connection)  # Use pandas to execute the query and fetch results

search3

#It seems like there are 3 vehicles that match the description.

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,183779,21,65,blue,blonde,female,H42W0X,Toyota,Prius
1,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS
2,664760,21,71,black,black,male,4H42WR,Nissan,Altima

We have a suspect! Lets check their witness statement. Do they have an alibi?

In [105]:
#Remember to write your query in the comments!
#Columns in table 'interview':
#- person_id (Type: INTEGER)
#- transcript (Type: TEXT)
#From the first and second query_search, we found that we have two prime suspects, now we want to see their statements.
print("Joe Germuska did not have a witness statement.")
with engine.connect() as connection:  # Establish a connection
    query_statement3 = text("""SELECT * 
                       FROM interview
                       WHERE person_id == 28819
                       """)  #we know Joe's ID and apply it to the interview 
    statement3 = pd.read_sql(query_statement3, connection)  # Use pandas to execute the query and fetch results

statement3

Joe Germuska did not have a witness statement.

Empty DataFrame
Columns: [person_id, transcript]
Index: []

Uh oh...turns out it wasn't just one person behind the crime...who is this additional person involved?

In [107]:
print("Jeremy Bowers said, I was hired by a woman with a lot of money...")
with engine.connect() as connection:  # Establish a connection
    query_statement4 = text("""SELECT * 
                       FROM interview
                       WHERE person_id == 67318
                       """) #we know Jeremy's id and apply it to the interview 
    statement4 = pd.read_sql(query_statement4, connection)  # Use pandas to execute the query and fetch results

statement4

Jeremy Bowers said, I was hired by a woman with a lot of money...

,person_id,transcript
0,67318,"I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5"" (65"") or 5'7"" (67""). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.\n"

In [108]:
#Remember to write our your query in the comments!
#You can complete this in a single query or multiple queries.
#Now we will look for this second person that was hired Jeremy.
with engine.connect() as connection:  # Establish a connection
    query_search4 = text("""SELECT * 
                       FROM drivers_license
                       WHERE height BETWEEN 65 AND 67
                       AND hair_color LIKE '%red%'
                       AND car_make LIKE '%Tesla%'
                       """) #we search from drivers_license for height between 65" and 67", red hair color, and that drives a Tesla.
    search4 = pd.read_sql(query_search4, connection)  # Use pandas to execute the query and fetch results

search4
#Three people match this description.

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,202298,68,66,green,red,female,500123,Tesla,Model S
1,291182,65,66,blue,red,female,08CM64,Tesla,Model S
2,918773,48,65,black,red,female,917UU3,Tesla,Model S

In [113]:
with engine.connect() as connection: # Establish connection
    # Define query to select all records from person and license_id is one from above
    query_search5 = text(""" SELECT * 
                     FROM person
                     WHERE license_id IN ('202298', '291182', '918773')
                     """) #using the ID's we got from search4
    search5 = pd.read_sql(query_search5, connection) # Use pd to read query with connection to db

search5 
#Now we have the names of the people who match the description.

,id,name,license_id,address_number,address_street_name,ssn
0,78881,Red Korb,918773,107,Camerata Dr,961388910
1,90700,Regina George,291182,332,Maple Ave,337169072
2,99716,Miranda Priestly,202298,1883,Golden Ave,987756388

Three different people match this description! Now which one attended the SQL Symphony Concert three times?

In [118]:
#Let's find the killer!
#Remember to write our your query in the comments!

#Columns in table 'facebook_event_checkin':
#- person_id (Type: INTEGER)
#- event_id (Type: INTEGER)
#- event_name (Type: TEXT)
#- date (Type: INTEGER)

#search5 gave three results, but we were also given an event, so we can try to narrow it down more.
with engine.connect() as connection:  # Establish a connection
    query_search6 = text("""SELECT * 
                       FROM facebook_event_checkin
                       WHERE event_name LIKE '%SQL%'
                       AND date LIKE '201712%'
                       AND person_id IN (78881, 90700, 99716)
                       """) 
    search6 = pd.read_sql(query_search6, connection)  # Use pandas to execute the query and fetch results

search6

#99716 went three times, which checks out, this means that Miranda Priestly is the true killer.

   person_id  event_id            event_name      date
0      99716      1143  SQL Symphony Concert  20171206
1      99716      1143  SQL Symphony Concert  20171212
2      99716      1143  SQL Symphony Concert  20171229

<b>The murderer(s) is/are: </b> Miranda Priestly hired Jeremy Bowers. Jeremy is the literal murderer, but Miranda is the one who wanted to have someone killed and paid off someone to do it.

In [125]:
#Disconnect from the database. Always remember to disconnect :) 
connection.close()